package com.java.ljj.explore;

public class HelloTest {

    /**
     * 一个项目设计的例子：
     * 1、项目背景是怎样的，要实现什么功能？
     * 2、实现这个功能的技术难点是什么？
     * 3、有哪些技术方案？在这些方案中怎么做trade-off？
     * 4、选取最终方案的理由？
     *
     * 一、实时沟通计数场景
     * 1、项目背景：在热线客服系统中，实时准确显示工单数。
     * 数据量：
     * 请求量：
     * 为什么？因为客服人员看到自己的工单个数达到要求后，就下班，不用等5分钟确认个数后再下班。
     * 需求抽象：在页面上显示工单总数，当工单插入数据库成功后，实时更新总数。
     * 2、技术难点？
     *
     *
     * 一个java性能调优的例子
     * 百度金融智能客服问答系统
     *
     * 一个linux性能调优的例子
     * 百度金融智能客服"猜你想问"系统
     *
     * 一个MySQL优化的例子
     * 百度金融客服系统: 工单表、联系人表、沟通表
     *
     * 一个优秀的开源Java项目源码分析的例子：
     * 1、主要实现什么功能？
     * 2、里面有什么难点？
     * 3、他是如何解决这个难点的？
     *
     * 常见的算法题目练习
     *
     * @param args
     */
    public static void main(String[] args) {
        System.out.println("hello test");
    }
}
